#!/bin/bash -e
set -e
set -o pipefail
##########################################################################################
# 事前に設定する内容
##########################################################################################
source ../config.env

##########################################################################################
# Private HTTP サーバの起動
##########################################################################################
echo "提供者が管理するPrivate HTTP サーバを起動しています..."
cd ${WORKDIR}/private-http-server
docker compose up -d
echo "Private HTTP サーバの起動が完了しました。"

